content.org/2020.org
#+hugo_base_dir: /home/plovs/Projects/qweb
#+category: blog

** DONE Git notes                                                          :git:
   CLOSED: [2020-12-24 Thu 23:58]
   :PROPERTIES:
   :EXPORT_FILE_NAME: git-notes
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :description
   :END:
   Notes to keep track of things I don't do all that often.
*** Working with git submodule

    Adding a submodule is very simple, here I add a theme to this site:

    #+begin_src shell
      git submodule add https://github.com/monkeyWzr/hugo-theme-cactus.git themes/cactus
    #+end_src

    Updating as well:

    #+begin_src shell
      git submodule update --remote --merge
    #+end_src

    Removing, not so much, the long version (google-fu):

    - Delete the relevant section from the .gitmodules file.
    - Stage the .gitmodules changes git add .gitmodules
    - Delete the relevant section from .git/config.
    - Run git rm --cached path_to_submodule (no trailing slash).
    - Run rm -rf .git/modules/path_to_submodule (no trailing slash).
    - Commit git commit -m "Removed submodule "
    - Delete the now untracked submodule files rm -rf path_to_submodule

    Remove a theme

    #+begin_src shell
      git submodule deinit -f themes/fuji #-f local changes
      git rm -f themes/fuji
      git commit -m "Removed submodule"
      rm -rf .git/modules/themes/fuji
    #+end_src
